app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "GreatTool"], ["description", "This is just Great!"], ["created_at", "2021-10-23 11:55:14.824440"], ["updated_at", "2021-10-23 11:55:14.824440"]]

  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("topic_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic_id", 1], ["created_at", "2021-10-23 17:30:56.163608"], ["updated_at", "2021-10-23 17:30:56.163608"]]

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]